app/Controllers/Api/Products.php

    protected function getStockAndPriceForProducts(array $productIds): array
    {
        if ($productIds === []) {
            return [];
        }

        $prefix = $this->stockBatchModel->db->DBPrefix;
        $sb     = $prefix . 'stock_batches';

        $batches = $this->stockBatchModel->db->table($sb)
            ->select("{$sb}.id, {$sb}.product_id, {$sb}.remaining_qty, {$sb}.unit_cost, {$sb}.selling_price, {$sb}.received_at")
            ->whereIn('product_id', $productIds)
            ->where('remaining_qty >', 0)
            ->orderBy('product_id')
            ->orderBy('received_at', 'asc')
            ->get()
            ->getResultArray();

        $skuById = [];
        foreach ($this->productModel->whereIn('id', $productIds)->findAll() as $pr) {
---
SELECT `stock_batches`.`id`, `stock_batches`.`product_id`, `stock_batches`.`remaining_qty`, `stock_batches`.`unit_cost`, `stock_batches`.`selling_price`, `stock_batches`.`received_at`
FROM `stock_batches`
WHERE `product_id` IN ('13','110','15','9','12','16','14','17','101','102','104','103','6','11','100','109','18','19')
AND `remaining_qty` > 0
ORDER BY `product_id`, `received_at` ASC
SELECT *
FROM `products`
WHERE `id` IN ('13','110','15','9','12','16','14','17','101','102','104','103','6','11','100','109','18','19')

                ->get()
                ->getResultArray();
            $ruleIds = array_unique(array_column($rules, 'procurement_rule_id'));
            $ruleRows = $ruleIds !== [] ? $this->procurementRuleModel->builder()->whereIn('id', $ruleIds)->get()->getResultArray() : [];
---
SELECT *
FROM `procurement_rules`
WHERE `id` IN ('32','31','21','20','19')