app/Controllers/Admin/Users.php

SELECT *
FROM `users`
ORDER BY `name` ASC
---
    public function index(): string
    {
        helper('form');
        $q = $this->request->getGet('q');
        $sortCol   = $this->request->getGet('sort');
        $sortOrder = strtolower((string) $this->request->getGet('order')) === 'desc' ? 'desc' : 'asc';
        $allowedSort = ['name', 'email', 'role', 'is_active', 'last_login_at', 'created_at'];

        $builder = $this->userModel->builder();

        if ($q !== null && $q !== '') {
            $builder->groupStart()
                ->like('name', $q)
                ->orLike('email', $q)
                ->orLike('phone', $q)
                ->groupEnd();
        }

        if ($sortCol !== null && in_array($sortCol, $allowedSort, true)) {
            $builder->orderBy($sortCol, $sortOrder);
        } else {
            $builder->orderBy('name', 'asc');
        }
        $users = $builder->get()->getResultArray();