app/Controllers/BaseController.php

INSERT INTO `user_activities` (`user_id`, `module`, `action`, `entity_id`, `description`, `created_at`) VALUES (1, 'sales', 'invoice_create', 5, 'Invoice INV-20260406-4AE75F for order ORD-20260406-026E06', '2026-04-06 11:29:12')
---
    protected function logActivity(string $module, string $action, ?int $entityId = null, ?string $description = null): void
    {
        $userId = session('user_id');
        if ($userId === null) {
            return;
        }
        $model = model(UserActivityModel::class);
        $model->insert([
            'user_id'     => (int) $userId,
            'module'      => $module,
            'action'      => $action,
            'entity_id'   => $entityId,
            'description' => $description !== null && strlen($description) > 255 ? substr($description, 0, 252) . '...' : $description,
        ]);