app/Controllers/Coupons.php

SELECT *
FROM `coupons`
ORDER BY `code` ASC
---
    public function index(): string
    {
        helper('form');
        $q = $this->request->getGet('q');
        $builder = $this->couponModel->builder();

        if ($q !== null && $q !== '') {
            $builder->like('code', $q);
        }

        $sortCol  = $this->request->getGet('sort');
        $sortOrder = strtolower((string) $this->request->getGet('order')) === 'desc' ? 'desc' : 'asc';
        $allowedSort = ['code', 'discount_type', 'discount_value', 'min_order_amount', 'max_discount_amount', 'valid_from', 'valid_to', 'used_count', 'is_active'];
        if ($sortCol !== null && in_array($sortCol, $allowedSort, true)) {
            $builder->orderBy($sortCol, $sortOrder);
        } else {
            $builder->orderBy('code', 'asc');
        }
        $coupons = $builder->get()->getResultArray();