app/Controllers/Gaming.php

SELECT `gaming_price_rules`.*, `gc`.`name` AS `category_name`, `gm`.`name` AS `mode_name`
FROM `gaming_price_rules`
LEFT JOIN `gaming_categories` `gc` ON `gc`.`id` = `gaming_price_rules`.`gaming_category_id`
LEFT JOIN `gaming_modes` `gm` ON `gm`.`id` = `gaming_price_rules`.`gaming_mode_id`
ORDER BY `gc`.`name` ASC, `gm`.`name` ASC
---
    public function priceRules(): string
    {
        helper('form');
        $categories = $this->categoryModel->where('is_active', 1)->orderBy('name', 'asc')->findAll();
        $modes      = $this->modeModel->where('is_active', 1)->orderBy('name', 'asc')->findAll();
        $prefix     = $this->priceRuleModel->db->DBPrefix;
        $rules      = $this->priceRuleModel->builder()
            ->select('gaming_price_rules.*, gc.name AS category_name, gm.name AS mode_name')
            ->join($prefix . 'gaming_categories gc', 'gc.id = gaming_price_rules.gaming_category_id', 'left')
            ->join($prefix . 'gaming_modes gm', 'gm.id = gaming_price_rules.gaming_mode_id', 'left')
            ->orderBy('gc.name', 'asc')
            ->orderBy('gm.name', 'asc')
            ->get()
            ->getResultArray();

SELECT `gaming_visits`.*, `c`.`name` AS `customer_name`, `c`.`phone` AS `customer_phone`, `gc`.`name` AS `category_name`, `gm`.`name` AS `mode_name`
FROM `gaming_visits`
LEFT JOIN `customers` `c` ON `c`.`id` = `gaming_visits`.`customer_id`
LEFT JOIN `gaming_price_rules` `gpr` ON `gpr`.`id` = `gaming_visits`.`gaming_price_rule_id`
LEFT JOIN `gaming_categories` `gc` ON `gc`.`id` = `gpr`.`gaming_category_id`
LEFT JOIN `gaming_modes` `gm` ON `gm`.`id` = `gpr`.`gaming_mode_id`
WHERE `gaming_visits`.`status` = 'ONGOING'
ORDER BY `gaming_visits`.`start_time` DESC
SELECT COUNT(*) AS `numrows`
FROM `gaming_visits`
WHERE `status` = 'FINISHED'
SELECT `gaming_visits`.*, `c`.`name` AS `customer_name`, `c`.`phone` AS `customer_phone`, `gc`.`name` AS `category_name`, `gm`.`name` AS `mode_name`
FROM `gaming_visits`
LEFT JOIN `customers` `c` ON `c`.`id` = `gaming_visits`.`customer_id`
LEFT JOIN `gaming_price_rules` `gpr` ON `gpr`.`id` = `gaming_visits`.`gaming_price_rule_id`
LEFT JOIN `gaming_categories` `gc` ON `gc`.`id` = `gpr`.`gaming_category_id`
LEFT JOIN `gaming_modes` `gm` ON `gm`.`id` = `gpr`.`gaming_mode_id`
WHERE `gaming_visits`.`status` = 'FINISHED'
ORDER BY `gaming_visits`.`end_time` DESC
 LIMIT 10
SELECT *
FROM `food_beverage_items`
WHERE `is_active` = 1
ORDER BY `name` ASC
SELECT *
FROM `gaming_price_rules`
WHERE `is_active` = 1
ORDER BY `id` ASC
---
    public function sessions(): string
    {
        helper('form');
        $prefix   = $this->visitModel->db->DBPrefix;
        $ongoing  = $this->visitModel->builder()
            ->select('gaming_visits.*, c.name AS customer_name, c.phone AS customer_phone, gc.name AS category_name, gm.name AS mode_name')
            ->join($prefix . 'customers c', 'c.id = gaming_visits.customer_id', 'left')
            ->join($prefix . 'gaming_price_rules gpr', 'gpr.id = gaming_visits.gaming_price_rule_id', 'left')
            ->join($prefix . 'gaming_categories gc', 'gc.id = gpr.gaming_category_id', 'left')
            ->join($prefix . 'gaming_modes gm', 'gm.id = gpr.gaming_mode_id', 'left')
            ->where('gaming_visits.status', 'ONGOING')
            ->orderBy('gaming_visits.start_time', 'desc')
            ->get()
            ->getResultArray();
        $finishedPerPage = 10;
        $finishedPage    = max(1, (int) $this->request->getGet('page'));
        $finishedTotal   = (int) $this->visitModel->builder()->where('status', 'FINISHED')->countAllResults();
        $finished        = $this->visitModel->builder()
            ->select('gaming_visits.*, c.name AS customer_name, c.phone AS customer_phone, gc.name AS category_name, gm.name AS mode_name')
            ->join($prefix . 'customers c', 'c.id = gaming_visits.customer_id', 'left')
            ->join($prefix . 'gaming_price_rules gpr', 'gpr.id = gaming_visits.gaming_price_rule_id', 'left')
            ->join($prefix . 'gaming_categories gc', 'gc.id = gpr.gaming_category_id', 'left')
            ->join($prefix . 'gaming_modes gm', 'gm.id = gpr.gaming_mode_id', 'left')
            ->where('gaming_visits.status', 'FINISHED')
            ->orderBy('gaming_visits.end_time', 'desc')
            ->limit($finishedPerPage, ($finishedPage - 1) * $finishedPerPage)
            ->get()
            ->getResultArray();

        $foodItems   = $this->foodBeverageItemModel->where('is_active', 1)->orderBy('name', 'asc')->findAll();
        $priceRules  = $this->priceRuleModel->where('is_active', 1)->orderBy('id', 'asc')->findAll();

SELECT `gaming_visit_food_items`.*, `fbi`.`name` AS `item_name`, `fbi`.`unit_label`
FROM `gaming_visit_food_items`
LEFT JOIN `food_beverage_items` `fbi` ON `fbi`.`id` = `gaming_visit_food_items`.`food_beverage_item_id`
WHERE `gaming_visit_food_items`.`gaming_visit_id` IN ('13','12','9','11','10','8','7','6','5','4')
---
        $visitIds    = array_merge(array_column($ongoing, 'id'), array_column($finished, 'id'));
        $foodByVisit = [];
        if (! empty($visitIds)) {
            $rows = $this->visitFoodModel->builder()
                ->select('gaming_visit_food_items.*, fbi.name AS item_name, fbi.unit_label')
                ->join($prefix . 'food_beverage_items fbi', 'fbi.id = gaming_visit_food_items.food_beverage_item_id', 'left')
                ->whereIn('gaming_visit_food_items.gaming_visit_id', $visitIds)
                ->get()
                ->getResultArray();

SELECT `id`, `name`, `phone`, `email`
FROM `customers`
WHERE `is_active` = 1
AND   (
`name` LIKE '%920%' ESCAPE '!'
OR  `phone` LIKE '%920%' ESCAPE '!'
OR  `email` LIKE '%920%' ESCAPE '!'
 )
ORDER BY `name` ASC
 LIMIT 20
---
    public function apiCustomerSearch(): ResponseInterface
    {
        $q = $this->request->getGet('q');
        if ($q === null || (string) $q === '') {
            return $this->response->setJSON(['customers' => []]);
        }
        $q = trim((string) $q);
        $customers = $this->customerModel->builder()
            ->select('id, name, phone, email')
            ->where('is_active', 1)
            ->groupStart()
            ->like('name', $q)
            ->orLike('phone', $q)
            ->orLike('email', $q)
            ->groupEnd()
            ->orderBy('name', 'asc')
            ->limit(20)
            ->get()
            ->getResultArray();