app/Controllers/Gaming.php

    public function sessions(): string
    {
        helper('form');
        $prefix   = $this->visitModel->db->DBPrefix;
        $ongoing  = $this->visitModel->builder()
            ->select('gaming_visits.*, c.name AS customer_name, c.phone AS customer_phone, gc.name AS category_name, gm.name AS mode_name')
            ->join($prefix . 'customers c', 'c.id = gaming_visits.customer_id', 'left')
            ->join($prefix . 'gaming_price_rules gpr', 'gpr.id = gaming_visits.gaming_price_rule_id', 'left')
            ->join($prefix . 'gaming_categories gc', 'gc.id = gpr.gaming_category_id', 'left')
            ->join($prefix . 'gaming_modes gm', 'gm.id = gpr.gaming_mode_id', 'left')
            ->where('gaming_visits.status', 'ONGOING')
            ->orderBy('gaming_visits.start_time', 'desc')
            ->get()
            ->getResultArray();
        $finishedPerPage = 10;
        $finishedPage    = max(1, (int) $this->request->getGet('page'));
        $finishedTotal   = (int) $this->visitModel->builder()->where('status', 'FINISHED')->countAllResults();
        $finished        = $this->visitModel->builder()
            ->select('gaming_visits.*, c.name AS customer_name, c.phone AS customer_phone, gc.name AS category_name, gm.name AS mode_name')
            ->join($prefix . 'customers c', 'c.id = gaming_visits.customer_id', 'left')
            ->join($prefix . 'gaming_price_rules gpr', 'gpr.id = gaming_visits.gaming_price_rule_id', 'left')
            ->join($prefix . 'gaming_categories gc', 'gc.id = gpr.gaming_category_id', 'left')
            ->join($prefix . 'gaming_modes gm', 'gm.id = gpr.gaming_mode_id', 'left')
            ->where('gaming_visits.status', 'FINISHED')
            ->orderBy('gaming_visits.end_time', 'desc')
            ->limit($finishedPerPage, ($finishedPage - 1) * $finishedPerPage)
            ->get()
            ->getResultArray();

        $foodItems = $this->foodBeverageItemModel->where('is_active', 1)
            ->notLike('name', '[Catalog]', 'after')
            ->orderBy('name', 'asc')
            ->findAll();
        $priceRules  = $this->priceRuleModel->where('is_active', 1)->orderBy('id', 'asc')->findAll();
---
SELECT `gaming_visits`.*, `c`.`name` AS `customer_name`, `c`.`phone` AS `customer_phone`, `gc`.`name` AS `category_name`, `gm`.`name` AS `mode_name`
FROM `gaming_visits`
LEFT JOIN `customers` `c` ON `c`.`id` = `gaming_visits`.`customer_id`
LEFT JOIN `gaming_price_rules` `gpr` ON `gpr`.`id` = `gaming_visits`.`gaming_price_rule_id`
LEFT JOIN `gaming_categories` `gc` ON `gc`.`id` = `gpr`.`gaming_category_id`
LEFT JOIN `gaming_modes` `gm` ON `gm`.`id` = `gpr`.`gaming_mode_id`
WHERE `gaming_visits`.`status` = 'ONGOING'
ORDER BY `gaming_visits`.`start_time` DESC
SELECT COUNT(*) AS `numrows`
FROM `gaming_visits`
WHERE `status` = 'FINISHED'
SELECT `gaming_visits`.*, `c`.`name` AS `customer_name`, `c`.`phone` AS `customer_phone`, `gc`.`name` AS `category_name`, `gm`.`name` AS `mode_name`
FROM `gaming_visits`
LEFT JOIN `customers` `c` ON `c`.`id` = `gaming_visits`.`customer_id`
LEFT JOIN `gaming_price_rules` `gpr` ON `gpr`.`id` = `gaming_visits`.`gaming_price_rule_id`
LEFT JOIN `gaming_categories` `gc` ON `gc`.`id` = `gpr`.`gaming_category_id`
LEFT JOIN `gaming_modes` `gm` ON `gm`.`id` = `gpr`.`gaming_mode_id`
WHERE `gaming_visits`.`status` = 'FINISHED'
ORDER BY `gaming_visits`.`end_time` DESC
 LIMIT 10
SELECT *
FROM `food_beverage_items`
WHERE `is_active` = 1
ORDER BY `name` ASC
SELECT *
FROM `gaming_price_rules`
WHERE `is_active` = 1
ORDER BY `id` ASC

        $visitIds    = array_merge(array_column($ongoing, 'id'), array_column($finished, 'id'));
        $foodByVisit = [];
        if (! empty($visitIds)) {
            $rows = $this->visitFoodModel->builder()
                ->select('gaming_visit_food_items.*, fbi.name AS fbi_name, fbi.unit_label, p.name AS product_name, COALESCE(fbi.name, p.name) AS item_name')
                ->join($prefix . 'food_beverage_items fbi', 'fbi.id = gaming_visit_food_items.food_beverage_item_id', 'left')
                ->join($prefix . 'products p', 'p.id = gaming_visit_food_items.product_id', 'left')
                ->whereIn('gaming_visit_food_items.gaming_visit_id', $visitIds)
                ->get()
                ->getResultArray();
---
SELECT `gaming_visit_food_items`.*, `fbi`.`name` AS `fbi_name`, `fbi`.`unit_label`, `p`.`name` AS `product_name`, COALESCE(fbi.name, p.name) AS item_name
FROM `gaming_visit_food_items`
LEFT JOIN `food_beverage_items` `fbi` ON `fbi`.`id` = `gaming_visit_food_items`.`food_beverage_item_id`
LEFT JOIN `products` `p` ON `p`.`id` = `gaming_visit_food_items`.`product_id`
WHERE `gaming_visit_food_items`.`gaming_visit_id` IN ('28','27','26','25','23','24','22','21','20','19','18')

            if ($customerId < 1) {
                return redirect()->back()->with('error', 'Search and select an existing customer, or add a new one with name and phone.');
            }
            if (! $this->customerModel->find($customerId)) {
---
SELECT *
FROM `customers`
WHERE `customers`.`id` = 5

        $ruleId     = (int) $this->request->getPost('gaming_price_rule_id');
        $noOfPlayers = (int) $this->request->getPost('no_of_players') ?: 1;
        $startTime   = $this->request->getPost('start_time');
        if (! $this->priceRuleModel->find($ruleId)) {
---
SELECT *
FROM `gaming_price_rules`
WHERE `gaming_price_rules`.`id` = 2