app/Controllers/Home.php

SELECT SUM(`total_amount`) AS `total_amount`
FROM `orders`
WHERE `status` = 'PAID'
SELECT COUNT(*) AS `numrows` FROM `orders`
SELECT SUM(`total_amount`) AS `total_amount`
FROM `orders`
WHERE `status` = 'PAID'
AND `created_at` >= '2026-04-01 00:00:00'
AND `created_at` <= '2026-04-30 23:59:59'
SELECT SUM(`total_amount`) AS `total_amount`
FROM `orders`
WHERE `status` = 'PAID'
AND `created_at` >= '2026-04-06 00:00:00'
AND `created_at` <= '2026-04-06 23:59:59'
---
    public function index(): string
    {
        $orderModel   = model(OrderModel::class);
        $customerModel = model(CustomerModel::class);
        $productModel = model(ProductModel::class);
        $invoiceModel    = model(InvoiceModel::class);
        $gamingVisitModel = model(GamingVisitModel::class);
        $stockBatchModel = model(StockBatchModel::class);
        $vendorModel     = model(VendorModel::class);

        $thisMonthStart = date('Y-m-01 00:00:00');
        $thisMonthEnd   = date('Y-m-t 23:59:59');
        $todayStart     = date('Y-m-d 00:00:00');
        $todayEnd       = date('Y-m-d 23:59:59');
        $lastMonthStart = date('Y-m-01 00:00:00', strtotime('first day of last month'));
        $lastMonthEnd   = date('Y-m-t 23:59:59', strtotime('last day of last month'));

        $orderItemModel = model(OrderItemModel::class);
        $ordersT        = $orderModel->getTable();
        $itemsT        = $orderItemModel->getTable();

        $invoicesT = $invoiceModel->getTable();
        $visitsT   = $gamingVisitModel->getTable();

        $orderT = $orderModel->db->table($ordersT);
        $totalOrderRevenueRow = $orderT->selectSum('total_amount')->where('status', 'PAID')->get()->getRow();
        $totalOrderRevenue = $totalOrderRevenueRow ? (float) ($totalOrderRevenueRow->total_amount ?? 0) : 0.0;
        $totalOrders = (int) $orderModel->db->table($ordersT)->countAll();
        $revenueOrderThisMonthRow = $orderT->selectSum('total_amount')->where('status', 'PAID')->where('created_at >=', $thisMonthStart)->where('created_at <=', $thisMonthEnd)->get()->getRow();
        $revenueOrderThisMonth = $revenueOrderThisMonthRow ? (float) ($revenueOrderThisMonthRow->total_amount ?? 0) : 0.0;
        $revenueOrderTodayRow = $orderT->selectSum('total_amount')->where('status', 'PAID')->where('created_at >=', $todayStart)->where('created_at <=', $todayEnd)->get()->getRow();

SELECT SUM(`total_amount`) AS `total_amount`
FROM `invoices`
WHERE gaming_visit_id IS NOT NULL
SELECT SUM(`total_amount`) AS `total_amount`
FROM `invoices`
WHERE gaming_visit_id IS NOT NULL
AND `created_at` >= '2026-04-01 00:00:00'
AND `created_at` <= '2026-04-30 23:59:59'
SELECT SUM(`total_amount`) AS `total_amount`
FROM `invoices`
WHERE gaming_visit_id IS NOT NULL
AND `created_at` >= '2026-04-06 00:00:00'
AND `created_at` <= '2026-04-06 23:59:59'
---
        $ordersThisMonth = (int) $orderT->where('status', 'PAID')->where('created_at >=', $thisMonthStart)->where('created_at <=', $thisMonthEnd)->countAllResults();

        $invT = $invoiceModel->db->table($invoicesT);
        $revenueGamingTotalRow = $invT->selectSum('total_amount')->where('gaming_visit_id IS NOT NULL', null, false)->get()->getRow();
        $revenueGamingTotal = $revenueGamingTotalRow ? (float) ($revenueGamingTotalRow->total_amount ?? 0) : 0.0;
        $revenueGamingThisMonthRow = $invoiceModel->db->table($invoicesT)->selectSum('total_amount')->where('gaming_visit_id IS NOT NULL', null, false)->where('created_at >=', $thisMonthStart)->where('created_at <=', $thisMonthEnd)->get()->getRow();
        $revenueGamingThisMonth = $revenueGamingThisMonthRow ? (float) ($revenueGamingThisMonthRow->total_amount ?? 0) : 0.0;
        $revenueGamingTodayRow = $invoiceModel->db->table($invoicesT)->selectSum('total_amount')->where('gaming_visit_id IS NOT NULL', null, false)->where('created_at >=', $todayStart)->where('created_at <=', $todayEnd)->get()->getRow();

SELECT COUNT(*) AS `numrows`
FROM `orders`
WHERE `status` = 'PENDING'
SELECT `orders`.*, `customers`.`name` AS `customer_name`
FROM `orders`
LEFT JOIN `customers` ON `customers`.`id` = `orders`.`customer_id`
ORDER BY `orders`.`created_at` DESC
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `gaming_visits`
WHERE `status` = 'ONGOING'
SELECT COUNT(*) AS `numrows`
FROM `gaming_visits`
WHERE `status` = 'FINISHED'
AND `end_time` >= '2026-04-06 00:00:00'
AND `end_time` <= '2026-04-06 23:59:59'
SELECT SUM(`total_amount`) AS `total_amount`
FROM `gaming_visits`
WHERE `status` = 'FINISHED'
AND invoice_id IS NULL
SELECT COUNT(*) AS `numrows`
FROM `gaming_visits`
WHERE `status` = 'FINISHED'
AND invoice_id IS NULL
SELECT `invoices`.*, `customers`.`name` AS `customer_name`
FROM `invoices`
LEFT JOIN `customers` `customers` ON `customers`.`id` = `invoices`.`customer_id`
WHERE invoices.gaming_visit_id IS NOT NULL
ORDER BY `invoices`.`created_at` DESC
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `customers`
WHERE `is_active` = 1
SELECT COUNT(*) AS `numrows`
FROM `products`
WHERE `is_active` = 1
SELECT COUNT(*) AS `numrows`
FROM `vendors`
WHERE `is_active` = 1
SELECT COUNT(*) AS `numrows`
FROM `invoices`
SELECT SUM(`total_amount`) AS `total_amount`
FROM `invoices`
SELECT `stock_batches`.*, `products`.`name` AS `product_name`
FROM `stock_batches`
LEFT JOIN `products` ON `products`.`id` = `stock_batches`.`product_id`
WHERE `stock_batches`.`remaining_qty` <= 5
AND `stock_batches`.`remaining_qty` >= 0
ORDER BY `stock_batches`.`remaining_qty` ASC
 LIMIT 10
---

        $ordersByStatus = [];
        foreach (['PENDING', 'CONFIRMED', 'PAID', 'CANCELLED'] as $status) {
            $ordersByStatus[$status] = (int) $orderModel->db->table($orderModel->getTable())->where('status', $status)->countAllResults();
        }

        $recentOrders = $orderModel->builder()
            ->select('orders.*, customers.name AS customer_name')
            ->join('customers', 'customers.id = orders.customer_id', 'left')
            ->orderBy('orders.created_at', 'desc')
            ->limit(5)
            ->get()
            ->getResultArray();

        $ongoingSessionsCount = (int) $gamingVisitModel->db->table($visitsT)->where('status', 'ONGOING')->countAllResults();
        $sessionsEndedToday   = (int) $gamingVisitModel->db->table($visitsT)->where('status', 'FINISHED')->where('end_time >=', $todayStart)->where('end_time <=', $todayEnd)->countAllResults();
        $unpaidResult = $gamingVisitModel->db->table($visitsT)->selectSum('total_amount')->where('status', 'FINISHED')->where('invoice_id IS NULL', null, false)->get()->getRow();
        $unpaidSessionsAmount = $unpaidResult && $unpaidResult->total_amount !== null ? (float) $unpaidResult->total_amount : 0.0;
        $unpaidSessionsCount  = (int) $gamingVisitModel->db->table($visitsT)->where('status', 'FINISHED')->where('invoice_id IS NULL', null, false)->countAllResults();

        $prefix = $invoiceModel->db->DBPrefix;
        $recentGamingInvoices = $invoiceModel->builder()
            ->select('invoices.*, customers.name AS customer_name')
            ->join($prefix . 'customers customers', 'customers.id = invoices.customer_id', 'left')
            ->where('invoices.gaming_visit_id IS NOT NULL', null, false)
            ->orderBy('invoices.created_at', 'desc')
            ->limit(5)
            ->get()
            ->getResultArray();

        $totalCustomers = (int) $customerModel->where('is_active', 1)->countAllResults();
        $totalProducts  = (int) $productModel->where('is_active', 1)->countAllResults();
        $totalVendors   = (int) $vendorModel->where('is_active', 1)->countAllResults();
        $totalInvoices  = (int) $invoiceModel->countAllResults();
        $invoiceSumRow = $invoiceModel->db->table($invoiceModel->getTable())->selectSum('total_amount')->get()->getRow();
        $invoicedAmount = $invoiceSumRow ? (float) ($invoiceSumRow->total_amount ?? 0) : 0.0;

        $lowStockThreshold = 5;
        $lowStockBatches   = $stockBatchModel->builder()
            ->select('stock_batches.*, products.name AS product_name')
            ->join('products', 'products.id = stock_batches.product_id', 'left')
            ->where('stock_batches.remaining_qty <=', $lowStockThreshold)
            ->where('stock_batches.remaining_qty >=', 0)
            ->orderBy('stock_batches.remaining_qty', 'asc')
            ->limit(10)
            ->get()
            ->getResultArray();