app/Controllers/Invoices.php

    public function view(int $id): string|RedirectResponse
    {
        $invoice = $this->invoiceModel->find($id);
        if (! $invoice) {
            return redirect()->to('sales/invoices')->with('error', 'Invoice not found.');
        }

        $customer = $this->customerModel->find($invoice['customer_id']);
        $order    = null;
        $items    = [];
        $isGaming = ! empty($invoice['gaming_visit_id']);

        if ($isGaming) {
            $visit = $this->gamingVisitModel->find($invoice['gaming_visit_id']);
            $prefix = $this->gamingVisitFoodModel->db->DBPrefix;
            $vfTable = $prefix . 'gaming_visit_food_items';
            $hasProd = $this->gamingVisitFoodModel->db->fieldExists('product_id', $vfTable);
            $sel     = 'gaming_visit_food_items.*, fbi.name AS fb_name';
            if ($hasProd) {
                $sel .= ', p.name AS product_name, p.sku AS product_sku';
            }
            $foodQ = $this->gamingVisitFoodModel->builder()
                ->select($sel)
                ->join($prefix . 'food_beverage_items fbi', 'fbi.id = gaming_visit_food_items.food_beverage_item_id', 'left');
            if ($hasProd) {
                $foodQ->join($prefix . 'products p', 'p.id = gaming_visit_food_items.product_id', 'left');
            }
            $foodRows = $foodQ->where('gaming_visit_food_items.gaming_visit_id', $invoice['gaming_visit_id'])
                ->get()
                ->getResultArray();
---
SELECT *
FROM `invoices`
WHERE `invoices`.`id` = 4
SELECT *
FROM `customers`
WHERE `customers`.`id` = '4'
SELECT *
FROM `gaming_visits`
WHERE `gaming_visits`.`id` = '3'
SELECT `gaming_visit_food_items`.*, `fbi`.`name` AS `fbi_name`, `p`.`name` AS `product_name`, `p`.`sku` AS `product_sku`, COALESCE(fbi.name, p.name) AS item_name
FROM `gaming_visit_food_items`
LEFT JOIN `food_beverage_items` `fbi` ON `fbi`.`id` = `gaming_visit_food_items`.`food_beverage_item_id`
LEFT JOIN `products` `p` ON `p`.`id` = `gaming_visit_food_items`.`product_id`
WHERE `gaming_visit_food_items`.`gaming_visit_id` = '3'

            $modeName = '—';
            if ($visit && ! empty($visit['gaming_price_rule_id'])) {
                $ruleModel = model(\App\Models\GamingPriceRuleModel::class);
                $rule = $ruleModel->find($visit['gaming_price_rule_id']);
                if ($rule) {
                    $catName = (model(GamingCategoryModel::class)->find($rule['gaming_category_id'])['name'] ?? '—');
                    $modeName = (model(GamingModeModel::class)->find($rule['gaming_mode_id'])['name'] ?? '—');
---
SELECT *
FROM `gaming_price_rules`
WHERE `gaming_price_rules`.`id` = '1'
SELECT *
FROM `gaming_categories`
WHERE `gaming_categories`.`id` = '1'
SELECT *
FROM `gaming_modes`
WHERE `gaming_modes`.`id` = '1'