app/Controllers/Orders.php

    public function index(): string
    {
        helper('form');
        $sortCol   = $this->request->getGet('sort');
        $sortOrder = strtolower((string) $this->request->getGet('order')) === 'desc' ? 'desc' : 'asc';
        $allowedSort = ['order_number', 'customer_name', 'customer_phone', 'status', 'total_amount', 'created_at'];
        $builder = $this->orderModel->builder()
            ->select('orders.*, customers.name AS customer_name, customers.phone AS customer_phone, invoices.id AS invoice_id')
            ->join('customers', 'customers.id = orders.customer_id', 'left')
            ->join('invoices', 'invoices.order_id = orders.id', 'left');
        if ($sortCol !== null && in_array($sortCol, $allowedSort, true)) {
            $orderCol = match ($sortCol) {
                'customer_name' => 'customers.name',
                'customer_phone' => 'customers.phone',
                default => 'orders.' . $sortCol,
            };
            $builder->orderBy($orderCol, $sortOrder);
        } else {
            $builder->orderBy('orders.created_at', 'desc');
        }
        $orders = $builder->get()->getResultArray();
---
SELECT `orders`.*, `customers`.`name` AS `customer_name`, `customers`.`phone` AS `customer_phone`, `invoices`.`id` AS `invoice_id`
FROM `orders`
LEFT JOIN `customers` ON `customers`.`id` = `orders`.`customer_id`
LEFT JOIN `invoices` ON `invoices`.`order_id` = `orders`.`id`
ORDER BY `orders`.`created_at` DESC

    public function setStatus(int $id): RedirectResponse
    {
        $order = $this->orderModel->find($id);
        if (! $order) {
            return redirect()->back()->with('error', 'Order not found.');
        }

        $status = $this->request->getPost('status');
        $allowed = ['PENDING', 'CONFIRMED', 'PAID', 'CANCELLED'];
        if ($status === null || ! in_array($status, $allowed, true)) {
            return redirect()->back()->with('error', 'Invalid status.');
        }

        $this->orderModel->update($id, ['status' => $status]);

        if ($status === 'PAID') {
            $existing = $this->invoiceModel->where('order_id', $id)->first();
            if (! $existing) {
                $invoiceNumber = 'INV-' . date('Ymd') . '-' . strtoupper(bin2hex(random_bytes(3)));
                $this->invoiceModel->insert([
                    'invoice_number'  => $invoiceNumber,
                    'order_id'        => $id,
                    'customer_id'     => (int) $order['customer_id'],
                    'subtotal'        => (float) $order['subtotal'],
                    'discount_amount' => (float) $order['discount_amount'],
                    'tax_amount'      => (float) $order['tax_amount'],
                    'total_amount'    => (float) $order['total_amount'],
                    'status'          => 'ISSUED',
                    'issued_at'       => date('Y-m-d H:i:s'),
                ]);
---
SELECT *
FROM `orders`
WHERE `orders`.`id` = 6
UPDATE `orders` SET `status` = 'CANCELLED', `updated_at` = '2026-04-05 18:38:42'
WHERE `orders`.`id` IN (6)
SELECT *
FROM `invoices`
WHERE `order_id` = 4
 LIMIT 1
INSERT INTO `invoices` (`invoice_number`, `order_id`, `customer_id`, `subtotal`, `discount_amount`, `tax_amount`, `total_amount`, `status`, `issued_at`, `created_at`, `updated_at`) VALUES ('INV-20260406-4AE75F', 4, 1, 2500, 10, 0, 2490, 'ISSUED', '2026-04-06 11:29:12', '2026-04-06 11:29:12', '2026-04-06 11:29:12')

    public function apiProducts(): ResponseInterface
    {
        $q = $this->request->getGet('q');
        if ($q === null || $q === '') {
            return $this->response->setJSON([]);
        }
        $products = $this->productModel
            ->where('is_active', 1)
            ->groupStart()
                ->like('name', $q)
                ->orLike('sku', $q)
            ->groupEnd()
            ->orderBy('name', 'asc')
            ->limit(15)
            ->findAll();
---
SELECT *
FROM `products`
WHERE `is_active` = 1
AND   (
`name` LIKE '%TY%' ESCAPE '!'
OR  `sku` LIKE '%TY%' ESCAPE '!'
 )
ORDER BY `name` ASC
 LIMIT 15

    public function apiValidateCoupon(): ResponseInterface
    {
        $code     = $this->request->getPost('code');
        $subtotal = (float) $this->request->getPost('subtotal');
        if ($code === null || $code === '') {
            return $this->response->setJSON(['valid' => false, 'message' => 'Coupon code is required.']);
        }
        $coupon = $this->couponModel->where('code', $code)->first();
---
SELECT *
FROM `coupons`
WHERE `code` = 'REG-ELC-50'
 LIMIT 1

    public function apiProductPrice(): ResponseInterface
    {
        $productId = (int) $this->request->getGet('product_id');
        if ($productId <= 0) {
            return $this->response->setStatusCode(400)->setJSON(['error' => 'Invalid product.']);
        }
        $product = $this->productModel->find($productId);
        if (! $product || ! (int) ($product['is_active'] ?? 0)) {
            return $this->response->setJSON(['found' => false]);
        }

        $batch = $this->stockBatchModel
            ->where('product_id', $productId)
            ->where('remaining_qty >', 0)
            ->orderBy('received_at', 'asc')
            ->first();
---
SELECT *
FROM `products`
WHERE `products`.`id` = 89
SELECT *
FROM `stock_batches`
WHERE `product_id` = 89
AND `remaining_qty` > 0
ORDER BY `received_at` ASC
 LIMIT 1