app/Controllers/Products.php

    public function index(): string
    {
        helper(['form', 'text']);
        $q = $this->request->getGet('q');
        $builder = $this->productModel->builder();

        // Keep FOOD-/BEVE- products in the dedicated /catalog/beverage page.
        $builder->notLike('sku', 'FOOD-', 'after')
            ->notLike('sku', 'BEVE-', 'after');

        if ($q !== null && $q !== '') {
            $builder->groupStart()
                ->like('name', $q)
                ->orLike('sku', $q)
                ->orLike('slug', $q)
                ->orLike('description', $q)
                ->groupEnd();
        }

        $sortCol  = $this->request->getGet('sort');
        $sortOrder = strtolower((string) $this->request->getGet('order')) === 'desc' ? 'desc' : 'asc';
        $allowedSort = ['name', 'sku', 'slug', 'unit', 'is_public', 'is_active'];
        if ($sortCol !== null && in_array($sortCol, $allowedSort, true)) {
            $builder->orderBy($sortCol, $sortOrder);
        } else {
            $builder->orderBy('name', 'asc');
        }
        $products = $builder->get()->getResultArray();
---
SELECT *
FROM `products`
ORDER BY `name` ASC

    public function beverage(): string
    {
        helper(['form', 'text']);
        $q = $this->request->getGet('q');
        $builder = $this->productModel->builder();

        $builder->groupStart()
            ->like('sku', 'FOOD-', 'after')
            ->orLike('sku', 'BEVE-', 'after')
            ->groupEnd();

        if ($q !== null && $q !== '') {
            $builder->groupStart()
                ->like('name', $q)
                ->orLike('sku', $q)
                ->orLike('slug', $q)
                ->orLike('description', $q)
                ->groupEnd();
        }

        $sortCol  = $this->request->getGet('sort');
        $sortOrder = strtolower((string) $this->request->getGet('order')) === 'desc' ? 'desc' : 'asc';
        $allowedSort = ['name', 'sku', 'slug', 'unit', 'is_public', 'is_active'];
        if ($sortCol !== null && in_array($sortCol, $allowedSort, true)) {
            $builder->orderBy($sortCol, $sortOrder);
        } else {
            $builder->orderBy('name', 'asc');
        }
        $products = $builder->get()->getResultArray();
---
SELECT *
FROM `products`
WHERE   (
`sku` LIKE 'FOOD-%' ESCAPE '!'
OR  `sku` LIKE 'BEVE-%' ESCAPE '!'
 )
ORDER BY `name` ASC