app/Controllers/StockBatches.php

        $ruleIds = array_unique($ruleIds);
        $rulesById = [];
        if ($ruleIds !== []) {
            foreach ($this->procurementRuleModel->whereIn('id', $ruleIds)->findAll() as $rule) {
---
SELECT *
FROM `procurement_rules`
WHERE `id` IN (32,31,21,20)