app/Controllers/Vendors.php

    public function index(): string
    {
        helper('form');
        $q = $this->request->getGet('q');
        $builder = $this->vendorModel->builder();

        if ($q !== null && $q !== '') {
            $builder->groupStart()
                ->like('name', $q)
                ->orLike('email', $q)
                ->orLike('phone', $q)
                ->orLike('contact_person', $q)
                ->groupEnd();
        }

        $sortCol  = $this->request->getGet('sort');
        $sortOrder = strtolower((string) $this->request->getGet('order')) === 'desc' ? 'desc' : 'asc';
        $allowedSort = ['name', 'contact_person', 'phone', 'email', 'is_active'];
        if ($sortCol !== null && in_array($sortCol, $allowedSort, true)) {
            $builder->orderBy($sortCol, $sortOrder);
        } else {
            $builder->orderBy('name', 'asc');
        }
        $vendors = $builder->get()->getResultArray();
---
SELECT *
FROM `vendors`
ORDER BY `name` ASC